import {Injectable} from '@angular/core';
import {Agent} from "../models/agent";
import {Questions} from "../models/questions";

@Injectable({
  providedIn: 'root'
})
export class QuestionsService {
  agentsNumbers: Agent[] = [
    {id: 777, team: 1,memberSide:1},
    {id: 690, team: 1,memberSide:2},
    {id: 111, team: 2,memberSide:1},
    {id: 303, team: 2,memberSide:2},
    {id: 906, team: 3,memberSide:1},
    {id: 228, team: 3,memberSide:2}];

  agentsQuestions:Questions[]=[
    {id:1,memberId:777,questionNumber:1,question:'Знайди свого напарника.Перевір чи немає когось за вхідними дверима!',
      title:'Аби продовжити введи номер цього солоденького',answer:690},
    {id:2,memberId:690,questionNumber:1,question:'Знайди свого напарника.Перевір чи немає когось за вхідними дверима!',
      title:'Тільки не кажи одному з агентів,що ви в одній команді)',answer:777},

    {id:3,memberId:111,questionNumber:1,question:'Знайди свого напарника\n' +
        'Твій напарник чекатиме тебе в туалеті',title:'Чинннааааааа) треба номер напарника:',answer:303},
    {id:4,memberId:303,questionNumber:1,question:'Знайди свого напарника\n' +
        'Твій напарник чекатиме тебе в туалеті',title:'Сподіваюсь він білий... введи його номер:',answer:111},

    {id:5,memberId:906,questionNumber:1,question:'Знайди свого напарника\n' +
        'Здається, щось підгоріло в духовці',title:'Контролюй ,аби він не перебрав,будь-ласка.Потрібен його номер ',answer:228},
    {id:6,memberId:228,questionNumber:1,question:'Знайди свого напарника\n' +
        'Здається, щось підгоріло в духовці',title:'Давно ми не пили за началь... ой тфу.Номер напарника:',answer:906},
    {id:7,memberId:777,questionNumber:2,question:'Інформація - найцінніша монета, на жаль, небезпечна.\n' +
        'Доводиться використовувати шифрування щоб ворожі спец. служби не перехопили потрібний Вам код.\n' +
        'Прямуйте в кімнату між входом та ванною.  В пустому куті лежить все необхідне для роботи.\n' +
        '\n' +
        'Підказка: 2 перші літери однакові',title:'Тобі знадобиться азбука',answer:1125415325},
    {id:8,memberId:690,questionNumber:2,question:'Інформація - найцінніша монета, на жаль, небезпечна.\n' +
        'Доводиться використовувати шифрування щоб ворожі спец. служби не перехопили потрібний Вам код.\n' +
        'Прямуйте в кімнату між входом та ванною.  В пустому куті лежить все необхідне для роботи.\n' +
        '\n' +
        'Підказка: 2 перші літери однакові',title:'Тобі знадобиться азбука',answer:1125415325},

    {id:9,memberId:111,questionNumber:2,question:'Роботи… ЦРУ створювало їх, щоб було легше контролювати людей. Але хитрі жінки почали  використовувати їх в корисливих цілях.\n' +
        'Ваша задача знайти робота, який виглядає як пральна машина, але не пускає воду, а навпаки. Щось він приховує!',title:'Тобі знадобиться азбука',answer:72612},
    {id:10,memberId:303,questionNumber:2,question:'Роботи… ЦРУ створювало їх, щоб було легше контролювати людей. Але хитрі жінки почали  використовувати їх в корисливих цілях.\n' +
        'Ваша задача знайти робота, який виглядає як пральна машина, але не пускає воду, а навпаки. Щось він приховує!',title:'Тобі знадобиться азбука',answer:72612},

    {id:11,memberId:906,questionNumber:2,question:'Чи знали ви, що 16% художників - наші агенти?\n' +
        'Вони залишили підказку на своїх творіннях у кімнаті з найбільшим дзеркалом.',title:'Тобі знадобиться азбука',answer:5212142},
    {id:12,memberId:228,questionNumber:2,
      question:'Чи знали ви, що 16% художників - наші агенти?\n' +
        'Вони залишили підказку на своїх творіннях у кімнаті з найбільшим дзеркалом.',title:'',answer:5212142},

    {id:13,memberId:777,questionNumber:3,question:'Зараз ви будете знайомитись з головою німецької розвідки.\n' +
        'Вона руда та гарна.\n' +
        'Будьте найкращими друзями для неї і вона дасть Вам знайти код.',title:'Тобі знадобиться азбука',answer:802051},
    {id:14,memberId:690,questionNumber:3,question:'Зараз ви будете знайомитись з головою німецької розвідки.\n' +
        'Вона руда та гарна.\n' +
        'Будьте найкращими друзями для неї і вона дасть Вам знайти код.',title:'Тобі знадобиться азбука',answer:802051},

    {id:15,memberId:111,questionNumber:3,question:'Хто спалив мацкву?',title:'Тобі знадобиться азбука',answer:42127624},
    {id:16,memberId:303,questionNumber:3,question:'Хто спалив мацкву?',title:'Тобі знадобиться азбука',answer:42127624},

    {id:17,memberId:906,questionNumber:3,question:'Прямуйте до головних агентів.\n' +
        'У них всі інструкції. Код надають також вони.',title:'Тобі знадобиться азбука',answer:33447},
    {id:18,memberId:228,questionNumber:3,
      question:'Прямуйте до головних агентів.\n' +
        'У них всі інструкції. Код надають також вони.',title:'',answer:33447},
    {id:19,memberId:777,questionNumber:4,question:'Прямуйте до головних агентів.\n' +
        'У них всі інструкції. Код надають також вони.',title:'Тобі знадобиться азбука',answer:33447},
    {id:20,memberId:690,questionNumber:4,question:'Прямуйте до головних агентів.\n' +
        'У них всі інструкції. Код надають також вони.',title:'Тобі знадобиться азбука',answer:33447},
    {id:21,memberId:111,questionNumber:4,question:'Інформація - найцінніша монета, на жаль, небезпечна.\n' +
        'Доводиться використовувати шифрування щоб ворожі спец. служби не перехопили потрібний Вам код.\n' +
        'Прямуйте в кімнату між входом та ванною.  В пустому куті лежить все необхідне для роботи.\n' +
        '\n' +
        'Підказка: 2 перші літери однакові',title:'Тобі знадобиться азбука',answer:1125415325},
    {id:22,memberId:303,questionNumber:4,question:'Інформація - найцінніша монета, на жаль, небезпечна.\n' +
        'Доводиться використовувати шифрування щоб ворожі спец. служби не перехопили потрібний Вам код.\n' +
        'Прямуйте в кімнату між входом та ванною.  В пустому куті лежить все необхідне для роботи.\n' +
        '\n' +
        'Підказка: 2 перші літери однакові',title:'Тобі знадобиться азбука',answer:1125415325},
    {id:23,memberId:906,questionNumber:4,question:'Роботи… ЦРУ створювало їх, щоб було легше контролювати людей. Але хитрі жінки почали  використовувати їх в корисливих цілях.\n' +
        'Знайдіть робота, який дасть фору Єноту полоскуну. У нього є те, що Вам потрібно!',title:'Тобі знадобиться азбука',answer:72612},
    {id:24,memberId:228,questionNumber:4,
      question:'Роботи… ЦРУ створювало їх, щоб було легше контролювати людей. Але хитрі жінки почали  використовувати їх в корисливих цілях.\n' +
        'Знайдіть робота, який дасть фору Єноту полоскуну. У нього є те, що Вам потрібно!',title:'Тобі знадобиться азбука',answer:72612},
    {id:25,memberId:777,questionNumber:5,question:'Чи знали ви, що 16% художників - наші агенти?\n' +
        'Вони залишили підказку на своїх творіннях у кімнаті з найбільшим дзеркалом.',title:'Тобі знадобиться азбука',answer:5212142},
    {id:26,memberId:690,questionNumber:5,question:'Чи знали ви, що 16% художників - наші агенти?\n' +
        'Вони залишили підказку на своїх творіннях у кімнаті з найбільшим дзеркалом.',title:'Тобі знадобиться азбука',answer:5212142},
    {id:27,memberId:111,questionNumber:5,question:'Прямуйте до головних агентів.\n' +
        'У них всі інструкції. Код надають також вони.',title:'Тобі знадобиться азбука',answer:33447},
    {id:28,memberId:303,questionNumber:5,question:'Прямуйте до головних агентів.\n' +
        'У них всі інструкції. Код надають також вони.',title:'Тобі знадобиться азбука',answer:33447},
    {id:29,memberId:906,questionNumber:5,question:'У Вас вже є необхідний інструмент. Повертайтесь в 1 клас і ідіть вивчати літери.',
      title:'Тобі знадобиться азбука',answer:513812},
    {id:30,memberId:228,questionNumber:5,question:'У Вас вже є необхідний інструмент. Повертайтесь в 1 клас і ідіть вивчати літери.',
      title:'Тобі знадобиться азбука',answer:513812},
    {id:31,memberId:777,questionNumber:6,question:'Хто спалив мацкву?',title:'Тобі знадобиться азбука',answer:42127624},
    {id:32,memberId:690,questionNumber:6,question:'Хто спалив мацкву?',title:'Тобі знадобиться азбука',answer:42127624},
    {id:33,memberId:111,questionNumber:6,question:'Зараз ви будете знайомитись з головою німецької розвідки.\n' +
        'Вона руда та гарна.\n' +
        'Будьте найкращими друзями для неї і вона дасть Вам знайти код.',title:'Тобі знадобиться азбука',answer:802051},
    {id:34,memberId:303,questionNumber:6,question:'Зараз ви будете знайомитись з головою німецької розвідки.\n' +
        'Вона руда та гарна.\n' +
        'Будьте найкращими друзями для неї і вона дасть Вам знайти код.',title:'Тобі знадобиться азбука',answer:802051},
    {id:35,memberId:906,questionNumber:6,question:'Інформація - найцінніша монета, на жаль, небезпечна.\n' +
        'Доводиться використовувати шифрування щоб ворожі спец. служби не перехопили потрібний Вам код.\n' +
        'Прямуйте в кімнату між входом та ванною.  В пустому куті лежить все необхідне для роботи.\n' +
        '\n' +
        'Підказка: 2 перші літери однакові',title:'Тобі знадобиться азбука',answer:1125415325},
    {id:36,memberId:228,questionNumber:6,question:'Інформація - найцінніша монета, на жаль, небезпечна.\n' +
        'Доводиться використовувати шифрування щоб ворожі спец. служби не перехопили потрібний Вам код.\n' +
        'Прямуйте в кімнату між входом та ванною.  В пустому куті лежить все необхідне для роботи.\n' +
        '\n' +
        'Підказка: 2 перші літери однакові',title:'Тобі знадобиться азбука',answer:1125415325},
    {id:31,memberId:777,questionNumber:7,question:'Роботи… ЦРУ створювало їх, щоб було легше контролювати людей. Але хитрі жінки почали  використовувати їх в корисливих цілях.\n' +
        'Ваша задача знайти робота, який допоможе не марати руки після вечері. Щось він приховує!',title:'Тобі знадобиться азбука',answer:73624},
    {id:32,memberId:690,questionNumber:7,question:'Роботи… ЦРУ створювало їх, щоб було легше контролювати людей. Але хитрі жінки почали  використовувати їх в корисливих цілях.\n' +
        'Ваша задача знайти робота, який допоможе не марати руки після вечері. Щось він приховує!',title:'Тобі знадобиться азбука',answer:73624},
    {id:33,memberId:111,questionNumber:7,question:'У Вас вже є необхідний інструмент. Повертайтесь в 1 клас і ідіть вивчати літери.',
      title:'Тобі знадобиться азбука',answer:513812},
    {id:34,memberId:303,questionNumber:7,question:'У Вас вже є необхідний інструмент. Повертайтесь в 1 клас і ідіть вивчати літери.',
      title:'Тобі знадобиться азбука',answer:513812},
    {id:35,memberId:906,questionNumber:7,question:'Хто спалив мацкву?',title:'Тобі знадобиться азбука',answer:42127624},
    {id:36,memberId:228,questionNumber:7,question:'Хто спалив мацкву?',title:'Тобі знадобиться азбука',answer:42127624},
    {id:37,memberId:777,questionNumber:8,question:'У Вас вже є необхідний інструмент. Повертайтесь в 1 клас і ідіть вивчати літери.',
      title:'Тобі знадобиться азбука',answer:513812},
    {id:38,memberId:690,questionNumber:8,question:'У Вас вже є необхідний інструмент. Повертайтесь в 1 клас і ідіть вивчати літери.',
      title:'Тобі знадобиться азбука',answer:513812},
    {id:39,memberId:111,questionNumber:8,question:'Чи знали ви, що 16% художників - наші агенти?\n' +
        'Вони залишили підказку на своїх творіннях у кімнаті з найбільшим дзеркалом.',title:'Тобі знадобиться азбука',answer:5212142},
    {id:40,memberId:303,questionNumber:8,question:'Чи знали ви, що 16% художників - наші агенти?\n' +
        'Вони залишили підказку на своїх творіннях у кімнаті з найбільшим дзеркалом.',title:'Тобі знадобиться азбука',answer:5212142},
    {id:41,memberId:906,questionNumber:8,question:'Зараз ви будете знайомитись з головою німецької розвідки.\n' +
        'Вона руда та гарна.\n' +
        'Будьте найкращими друзями для неї і вона дасть Вам знайти код.',title:'Тобі знадобиться азбука',answer:802051},
    {id:42,memberId:228,questionNumber:8,question:'Зараз ви будете знайомитись з головою німецької розвідки.\n' +
        'Вона руда та гарна.\n' +
        'Будьте найкращими друзями для неї і вона дасть Вам знайти код.',title:'Тобі знадобиться азбука',answer:802051},
    {id:37,memberId:777,questionNumber:9,question:'Коробка від якої залежить, чи будуть працювати розетки.',
      title:'Азбука тобі не потрібна',answer:513812},
    {id:38,memberId:690,questionNumber:9,question:'Коробка від якої залежить, чи будуть працювати розетки.',
      title:'Тобі знадобиться азбука',answer:513812},
    {id:39,memberId:111,questionNumber:9,question:'Всі ці флакончики заміняє один 3в1.',title:'Азбука тобі не потрібна',answer:5212142},
    {id:40,memberId:303,questionNumber:9,question:'Всі ці флакончики заміняє один 3в1.',title:'Азбука тобі не потрібна',answer:5212142},
    {id:41,memberId:906,questionNumber:9,question:'Там зима круглий рік .',title:'Азбука тобі не потрібна',answer:802051},
    {id:42,memberId:228,questionNumber:9,question:'Там зима круглий рік .',title:'Азбука тобі не потрібна',answer:802051},

  ]

  constructor() {
  }

  getAgentNumbers(): Array<Agent> {
    return this.agentsNumbers
  }
  getQuestions(questionNumber:number,memberId:number):Questions{
    return this.agentsQuestions.find(x=>x.memberId==memberId && x.questionNumber==questionNumber)
  }
}
